replication/replication.org
#+SETUPFILE: ../theme-bigblow.setup 
#+OPTIONS: author:nil creator:nil timestamp:nil

ZigZag Replication

#+BEGIN_SRC lisp :exports none
  (asdf:load-system :orient)
  (defpackage cryptolab.replication
    (:use :common-lisp :orient :filecoin :orient.base.util)
    (:nicknames :replication))

  (in-package cryptolab.replication)

#+END_SRC

#+RESULTS:
: #<PACKAGE "CRYPTOLAB.REPLICATION">

#+BEGIN_SRC lisp :package replication :exports results :results raw :var timestamp=(format-time-string "[%F %r]: ")
  (format t "~A Generated from commit ~A" timestamp (project-commit-link :org))
#+END_SRC

#+RESULTS:
[2019-08-06 05:46:07 PM]:  Generated from commit [[https://github.com/filecoin-project/orient/commit/6e2f0b85075db00a92257a670cd12e4bbe713578
][6e2f0b85075db00a92257a670cd12e4bbe713578
]]
#+NAME: init
#+BEGIN_SRC lisp :package replication :exports results :results output :var sector-gib=32 spedersen=1.7 blake2s-speedup=1.666 gpu-speedup=3 seal-parallelism=14
  (defvar *zigzag-base*)
  (defvar *zigzag-base-plan*)
  (defvar *zigzag-base-report*)
  (defvar *zigzag-base-input*)
  (defvar *zigzag-no-hybrid*)
  (defvar *filecoin-base* (solve-for (filecoin-system) '()))

  (let ((*spedersen* 1)
        (*gpu-speedup* 1)
        (*blake2s-speedup* 1))
    (multiple-value-setq (*zigzag-base-report* *zigzag-base* *zigzag-base-input* *zigzag-base-plan*)
      (report-solution-for '() :system (filecoin-system)
                                          ; :initial-data initial-data 
                           :format :html
                           :override-data (tuple (sector-gib sector-gib) (seal-parallelism seal-parallelism) (max-beta-merkle-height 30))
                                          ; :project-solution t
                           :return-plan t
                           :return-defaulted-data t))

    (setq *zigzag-no-hybrid* (solve-for (filecoin-system) '() nil
                                        :override-data (tuple (sector-gib sector-gib) (seal-parallelism seal-parallelism) (max-beta-merkle-height 0))))
    
    (format t "Initialized current ZigZag with ~A GiB sectors. Spedersen: ~d; Blake2s speedup: ~d GPU speedup: ~d~%~%"
            sector-gib *spedersen* *blake2s-speedup* *gpu-speedup* (tref 'seal-time (extract *zigzag-base*))))

  (defvar *zigzag-alt-base*)
  (defvar *zigzag-alt-base-plan*)
  (defvar *zigzag-alt-base-report*)
  (defvar *zigzag-alt-base-input*)
  (defvar *zigzag-alt-no-hybrid*)

  (let ((*spedersen* spedersen)
        (*gpu-speedup* gpu-speedup)
        (*blake2s-speedup* blake2s-speedup))
    (multiple-value-setq (*zigzag-alt-base-report* *zigzag-alt-base* *zigzag-alt-base-input* *zigzag-alt-base-plan*)
      (report-solution-for '() :system (filecoin-system)
                                          ; :initial-data initial-data 
                           :format :html
                           :override-data (tuple (sector-gib sector-gib) (seal-parallelism seal-parallelism) (max-beta-merkle-height 30))
                                          ; :project-solution t
                           :return-plan t
                           :return-defaulted-data t))

    (setq *zigzag-alt-no-hybrid* (solve-for (filecoin-system) '() nil
                                            :override-data (tuple (sector-gib sector-gib) (seal-parallelism seal-parallelism) (max-beta-merkle-height 0))))
    
    (format t "Intialized Alternate ZigZag with ~A GiB sectors. Spedersen: ~d; Blake2s speedup: ~d GPU speedup: ~d~%~%"
            sector-gib *spedersen* *blake2s-speedup* *gpu-speedup* (tref 'seal-time (extract *zigzag-base*))))

#+END_SRC

#+RESULTS: init
: Initialized current ZigZag with 32 GiB sectors. Spedersen: 1; Blake2s speedup: 1 GPU speedup: 1
: 
: Intialized Alternate ZigZag with 32 GiB sectors. Spedersen: 1.7; Blake2s speedup: 1.666 GPU speedup: 3
: 

# #+CALL: init(sector-gib=64)

# #+RESULTS:
# : Intialized with 64 GiB sectors.
* Current ZigZag
** Sector
#+BEGIN_SRC  lisp :package replication :exports results
(org-present (project '(sector-size sector-gib) *zigzag-base*) nil)
#+END_SRC
#+RESULTS:
| SECTOR-GIB | SECTOR-SIZE |
|         32 | 34359738368 |

** Replication
#+BEGIN_SRC lisp :package replication :exports results

(org-present (project '(replication-time replication-time-per-GiB) *zigzag-base*) nil)

#+END_SRC

#+RESULTS:
| REPLICATION-TIME | REPLICATION-TIME-PER-GIB |
|        6855.9707 |                214.24908 |

** Sealing
*** *No Hybrid Merkle*
#+BEGIN_SRC lisp :package replication :exports results

(org-present (project '(seal-time gib-seal-cost gib-hour-seal-investment seal-parallelism gib-seal-time wall-clock-seal-time wall-clock-seal-time-per-gib) *zigzag-no-hybrid*) nil)

#+END_SRC

#+RESULTS:
| SEAL-PARALLELISM | WALL-CLOCK-SEAL-TIME | GIB-SEAL-COST | SEAL-TIME | GIB-HOUR-SEAL-INVESTMENT | GIB-SEAL-TIME | WALL-CLOCK-SEAL-TIME-PER-GIB |
|               14 |             67107.86 |    0.18755668 | 946366.06 |                410.74915 |      29573.94 |                    2097.1206 |

*** *Hybrid Merkle*
#+BEGIN_SRC lisp :package replication :exports results

(org-present (project '(seal-time gib-seal-cost  gib-hour-seal-investment seal-parallelism gib-seal-time wall-clock-seal-time wall-clock-seal-time-per-gib) *zigzag-base*) nil)

#+END_SRC

#+RESULTS:
| SEAL-PARALLELISM | WALL-CLOCK-SEAL-TIME | GIB-SEAL-COST | SEAL-TIME | GIB-HOUR-SEAL-INVESTMENT | GIB-SEAL-TIME | WALL-CLOCK-SEAL-TIME-PER-GIB |
|               14 |             59727.72 |    0.16707969 | 843044.06 |                365.90454 |     26345.127 |                    1866.4912 |

*** *Hybrid Savings*
#+BEGIN_SRC lisp :package replication :exports results :results output
    (let ((percent-cpu-time (* 100.0 (/ (tref 'seal-time (extract *zigzag-base*))
                                       (tref 'seal-time (extract *zigzag-no-hybrid*)))))
          (percent-wall-time (* 100.0 (/ (tref 'wall-clock-seal-time (extract *zigzag-base*))
                                         (tref 'wall-clock-seal-time (extract *zigzag-no-hybrid*))))))

      (format t "Hybrid SEAL-TIME (CPU) is ~,2f% of non-hybrid SEAL-TIME.~%This is a savings of ~,2f%.~%~%" percent-cpu-time (- 100 percent-cpu-time))
      (format t "Hybrid WALL-CLOCK-SEAL-TIME (CPU) is ~,2f% of non-hybrid WALL-CLOCK-SEAL-TIME.~%This is a savings of ~,2f%.~%~%" percent-wall-time (- 100 percent-wall-time)))
#+END_SRC

#+RESULTS:
: Hybrid SEAL-TIME (CPU) is 89.08% of non-hybrid SEAL-TIME.
: This is a savings of 10.92%.
: 
: Hybrid WALL-CLOCK-SEAL-TIME (CPU) is 89.00% of non-hybrid WALL-CLOCK-SEAL-TIME.
: This is a savings of 11.00%.
: 

** Filecoin Growth Rate (FGR)
#+BEGIN_SRC lisp :package replication :exports results

(org-present (project '(one-year-fgr two-year-fgr three-year-fgr) *zigzag-base*) nil)

#+END_SRC

#+RESULTS:
| ONE-YEAR-FGR | TWO-YEAR-FGR | THREE-YEAR-FGR |
|    1.1387482 |    3.5830317 |       6.027315 |

** Hybrid Merkle Trees
#+BEGIN_SRC lisp :package replication :exports results
(org-present (tref 'optimal-heights (extract (project '(optimal-heights) *zigzag-base*))) nil)
#+END_SRC

#+RESULTS:
| CIRCUIT-TIME | HASHING-TIME | LAYER-INDEX | CONSTRAINTS | LOWEST-TIME | OPTIMAL-BETA-MERKLE-HEIGHT |
|          0.0 |     97.94244 |           0 |           0 |    97.94244 |                         30 |
|    20836.523 |    3596.2986 |           1 |   171690880 |   24432.822 |                          3 |
|    20836.523 |    3596.2986 |           2 |   171690880 |   24432.822 |                          3 |
|    20836.523 |    3596.2986 |           3 |   171690880 |   24432.822 |                          3 |
|    27110.928 |     7094.655 |           4 |   225136320 |   34205.582 |                          2 |
|     39762.69 |     7094.655 |           5 |   330199936 |   46857.348 |                          2 |
|     50527.54 |    14091.367 |           6 |   424019904 |   64618.906 |                          1 |
|     75791.31 |    14091.367 |           7 |   636029856 |    89882.68 |                          1 |
|    93488.586 |    28084.791 |           8 |   796337056 |  121573.375 |                          0 |
|    139919.16 |    28084.791 |           9 |  1191833312 |   168003.95 |                          0 |
|    209565.02 |    28084.791 |          10 |  1785077696 |   237649.81 |                          0 |

