replication/replication.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>replication</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/bigblow/css/hideshow.css"/>
</head>
<body>
<div id="content">
<h1 class="title">replication</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Current ZigZag</a>
<ul>
<li><a href="#sec-1-1">1.1. Sector</a></li>
<li><a href="#sec-1-2">1.2. Replication</a></li>
<li><a href="#sec-1-3">1.3. Sealing</a></li>
<li><a href="#sec-1-4">1.4. Filecoin Growth Rate (FGR) )</a></li>
<li><a href="#sec-1-5">1.5. Hybrid Merkle Trees</a></li>
<li><a href="#sec-1-6">1.6. Inputs</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Alternate ZigZag Projections</a>
<ul>
<li><a href="#sec-2-1">2.1. Sector</a></li>
<li><a href="#sec-2-2">2.2. Replication</a></li>
<li><a href="#sec-2-3">2.3. Sealing</a></li>
<li><a href="#sec-2-4">2.4. FGR</a></li>
<li><a href="#sec-2-5">2.5. Hybrid Merkle Trees</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Schema</a></li>
<li><a href="#sec-4">4. JSON</a></li>
</ul>
</div>
</div>
<p>
ZigZag Replication
</p>

<p>
<span class="timestamp-wrapper"><span class="timestamp">[2019-08-06 05:46:07 PM]</span></span>:  Generated from commit <a href="https://github.com/filecoin-project/orient/commit/6e2f0b85075db00a92257a670cd12e4bbe713578">6e2f0b85075db00a92257a670cd12e4bbe713578
</a>
</p>
<pre class="example">
Initialized current ZigZag with 32 GiB sectors. Spedersen: 1; Blake2s speedup: 1 GPU speedup: 1

Intialized Alternate ZigZag with 32 GiB sectors. Spedersen: 1.7; Blake2s speedup: 1.666 GPU speedup: 3
</pre>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Current ZigZag</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Sector</h3>
<div class="outline-text-3" id="text-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="right" />
</colgroup>
<tbody>
<tr>
<td class="right">SECTOR-GIB</td>
<td class="right">SECTOR-SIZE</td>
</tr>

<tr>
<td class="right">32</td>
<td class="right">34359738368</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Replication</h3>
<div class="outline-text-3" id="text-1-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="right" />
</colgroup>
<tbody>
<tr>
<td class="right">REPLICATION-TIME</td>
<td class="right">REPLICATION-TIME-PER-GIB</td>
</tr>

<tr>
<td class="right">6855.9707</td>
<td class="right">214.24908</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Sealing</h3>
<div class="outline-text-3" id="text-1-3">
</div><ol class="org-ol"><li><a id="sec-1-3-1" name="sec-1-3-1"></a><b>No Hybrid Merkle</b><br  /><div class="outline-text-4" id="text-1-3-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />
</colgroup>
<tbody>
<tr>
<td class="right">SEAL-PARALLELISM</td>
<td class="right">WALL-CLOCK-SEAL-TIME</td>
<td class="right">GIB-SEAL-COST</td>
<td class="right">SEAL-TIME</td>
<td class="right">GIB-HOUR-SEAL-INVESTMENT</td>
<td class="right">GIB-SEAL-TIME</td>
<td class="right">WALL-CLOCK-SEAL-TIME-PER-GIB</td>
</tr>

<tr>
<td class="right">14</td>
<td class="right">67107.86</td>
<td class="right">0.18755668</td>
<td class="right">946366.06</td>
<td class="right">410.74915</td>
<td class="right">29573.94</td>
<td class="right">2097.1206</td>
</tr>
</tbody>
</table>
</div>
</li>

<li><a id="sec-1-3-2" name="sec-1-3-2"></a><b>Hybrid Merkle</b><br  /><div class="outline-text-4" id="text-1-3-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />
</colgroup>
<tbody>
<tr>
<td class="right">SEAL-PARALLELISM</td>
<td class="right">WALL-CLOCK-SEAL-TIME</td>
<td class="right">GIB-SEAL-COST</td>
<td class="right">SEAL-TIME</td>
<td class="right">GIB-HOUR-SEAL-INVESTMENT</td>
<td class="right">GIB-SEAL-TIME</td>
<td class="right">WALL-CLOCK-SEAL-TIME-PER-GIB</td>
</tr>

<tr>
<td class="right">14</td>
<td class="right">59727.72</td>
<td class="right">0.16707969</td>
<td class="right">843044.06</td>
<td class="right">365.90454</td>
<td class="right">26345.127</td>
<td class="right">1866.4912</td>
</tr>
</tbody>
</table>
</div>
</li>

<li><a id="sec-1-3-3" name="sec-1-3-3"></a><b>Hybrid Savings</b><br  /><div class="outline-text-4" id="text-1-3-3">
<pre class="example">
Hybrid SEAL-TIME (CPU) is 89.08% of non-hybrid SEAL-TIME.
This is a savings of 10.92%.

Hybrid WALL-CLOCK-SEAL-TIME (CPU) is 89.00% of non-hybrid WALL-CLOCK-SEAL-TIME.
This is a savings of 11.00%.
</pre>
</div>
</li></ol>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Filecoin Growth Rate (FGR) )</h3>
<div class="outline-text-3" id="text-1-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="right" />

<col  class="right" />
</colgroup>
<tbody>
<tr>
<td class="right">ONE-YEAR-FGR</td>
<td class="right">TWO-YEAR-FGR</td>
<td class="right">THREE-YEAR-FGR</td>
</tr>

<tr>
<td class="right">1.1387482</td>
<td class="right">3.5830317</td>
<td class="right">6.027315</td>
</tr>
</tbody>
</table>
<p>
)
</p>
</div>
</div>
