replication/replication.org
** Inputs
#+BEGIN_SRC lisp :package replication :exports results
  (let ((input  *zigzag-base-input*))
    (loop for attr in (fset:convert 'list (attributes input))
       collect (list (symbol-name attr) (present-data :org (tref attr input) nil))))

#+END_SRC

#+RESULTS:
| LAYERS                              |                                                                                                                                                                                                                                                                   10 |
| SEAL-GHZ                            |                                                                                                                                                                                                                                                                  5.0 |
| NODE-BYTES                          |                                                                                                                                                                                                                                                                   32 |
| PARTITIONS                          |                                                                                                                                                                                                                                                                    1 |
| SECTOR-GIB                          |                                                                                                                                                                                                                                                                   32 |
| SLOTH-ITER                          |                                                                                                                                                                                                                                                                    0 |
| BASE-DEGREE                         |                                                                                                                                                                                                                                                                    5 |
| CPU-GHZ-COST                        |                                                                                                                                                                                                                                                                 10.0 |
| ZIGZAG-DELTA                        |                                                                                                                                                                                                                                                                0.003 |
| ZIGZAG-TAPER                        |                                                                                                                                                                                                                                                                  1/3 |
| ANNUAL-INCOME                       |                                                                                                                                                                                                                                                              50000.0 |
| ZIGZAG-LAMBDA                       |                                                                                                                                                                                                                                                                    8 |
| HASH-FUNCTIONS                      | ((FILECOIN::HASH-FUNCTION-TIME FILECOIN::HASH-FUNCTION-CONSTRAINTS FILECOIN::HASH-FUNCTION-NAME CIRCUIT-TIME FILECOIN::HASH-FUNCTION-SIZE) (2.6156e-05 1324 :PEDERSEN 0.153988 32) (4.5608e-08 5162 :BLAKE2S-KDF 0.65253 32) (9.1216e-08 10324 :BLAKE2S 1.30506 32)) |
| TIB-DRIVE-COST                      |                                                                                                                                                                                                                                                                 30.0 |
| ZIGZAG-EPSILON                      |                                                                                                                                                                                                                                                                0.007 |
| EXPANSION-DEGREE                    |                                                                                                                                                                                                                                                                    8 |
| SEAL-PARALLELISM                    |                                                                                                                                                                                                                                                                   14 |
| AWS-GLACIER-PRICE                   |                                                                                                                                                                                                                                                                0.004 |
| MUST-HAVE-FILECOIN                  |                                                                                                                                                                                                                                                                    T |
| MINIMUM-ONE-YEAR-FGR                |                                                                                                                                                                                                                                                                   -2 |
| MINIMUM-TWO-YEAR-FGR                |                                                                                                                                                                                                                                                                 0.25 |
| UP-FRONT-MEMORY-COST                |                                                                                                                                                                                                                                                                  0.0 |
| KDF-HASH-FUNCTION-NAME              |                                                                                                                                                                                                                                                          BLAKE2S-KDF |
| MAX-BETA-MERKLE-HEIGHT              |                                                                                                                                                                                                                                                                   30 |
| MINIMUM-THREE-YEAR-FGR              |                                                                                                                                                                                                                                                                  1.0 |
| BETA-HASH-FUNCTION-NAME             |                                                                                                                                                                                                                                                              BLAKE2S |
| ALPHA-HASH-FUNCTION-NAME            |                                                                                                                                                                                                                                                             PEDERSEN |
| MINER-MONTHS-TO-CAPACITY            |                                                                                                                                                                                                                                                                    3 |
| BENCH-CIRCUIT-CONSTRAINTS           |                                                                                                                                                                                                                                                                10324 |
| MERKLE-HASH-FUNCTION-NAME           |                                                                                                                                                                                                                                                             PEDERSEN |
| SINGLE-CIRCUIT-PROOF-SIZE           |                                                                                                                                                                                                                                                                  192 |
| BENCH-CIRCUIT-PROVING-TIME          |                                                                                                                                                                                                                                                              0.14464 |
| COMMODITY-STORAGE-DISCOUNT          |                                                                                                                                                                                                                                                                   10 |
| MAXIMUM-ALLOWABLE-SPACE-GAP         |                                                                                                                                                                                                                                                                 0.02 |
| SINGLE-SLOTH-ITERATION-TIME         |                                                                                                                                                                                                                                                                  123 |
| TOTAL-ZIGZAG-OTHER-CONSTRAINTS      |                                                                                                                                                                                                                                                                    0 |
| ALPHA-MERKLE-HASH-FUNCTION-NAME     |                                                                                                                                                                                                                                                             PEDERSEN |
| SINGLE-SLOTH-ITERATION-CONSTRAINTS  |                                                                                                                                                                                                                                                                  321 |
| MINIMUM-STORAGE-TO-PROOF-SIZE-RATIO |                                                                                                                                                                                                                                                        1073741824/25 |

