replication/replication.org
* Alternate ZigZag Projections
** Sector
#+BEGIN_SRC  lisp :package replication :exports results
(org-present (project '(sector-size sector-gib) *zigzag-alt-base*) nil)
#+END_SRC
#+RESULTS:
| SECTOR-GIB | SECTOR-SIZE |
|         32 | 34359738368 |

** Replication
#+BEGIN_SRC lisp :package replication :exports results

(org-present (project '(replication-time replication-time-per-GiB) *zigzag-alt-base*) nil)

#+END_SRC

#+RESULTS:
| REPLICATION-TIME | REPLICATION-TIME-PER-GIB |
|        4115.2285 |                128.60089 |

** Sealing
*** *No Hybrid Merkle*
#+BEGIN_SRC lisp :package replication :exports results

(org-present (project '(gib-seal-cost gib-hour-seal-investment seal-time seal-parallelism gib-seal-time wall-clock-seal-time wall-clock-seal-time-per-gib) *zigzag-alt-no-hybrid*) nil)

#+END_SRC

#+RESULTS:
| SEAL-PARALLELISM | WALL-CLOCK-SEAL-TIME | GIB-SEAL-COST | SEAL-TIME | GIB-HOUR-SEAL-INVESTMENT | GIB-SEAL-TIME | WALL-CLOCK-SEAL-TIME-PER-GIB |
|               14 |            27994.111 |    0.07848823 | 396032.78 |                171.88922 |     12376.024 |                      874.816 |

*** *Hybrid Merkle*
#+BEGIN_SRC lisp :package replication :exports results

(org-present (project '(seal-time gib-seal-cost gib-hour-seal-investment  seal-parallelism gib-seal-time wall-clock-seal-time wall-clock-seal-time-per-gib) *zigzag-alt-base*) nil)

#+END_SRC

#+RESULTS:
| SEAL-PARALLELISM | WALL-CLOCK-SEAL-TIME | GIB-SEAL-COST | SEAL-TIME | GIB-HOUR-SEAL-INVESTMENT | GIB-SEAL-TIME | WALL-CLOCK-SEAL-TIME-PER-GIB |
|               14 |            22164.979 |   0.062314685 |  314424.9 |                136.46916 |      9825.778 |                     692.6556 |

*** *Hybrid Savings*
#+BEGIN_SRC lisp :package replication :exports results :results output
    (let ((percent-cpu-time (* 100.0 (/ (tref 'seal-time (extract *zigzag-base*))
                                       (tref 'seal-time (extract *zigzag-no-hybrid*)))))
          (percent-wall-time (* 100.0 (/ (tref 'wall-clock-seal-time (extract *zigzag-alt-base*))
                                         (tref 'wall-clock-seal-time (extract *zigzag-alt-no-hybrid*))))))

      (format t "Hybrid SEAL-TIME (CPU) is ~,2f% of non-hybrid SEAL-TIME.~%This is a savings of ~,2f%.~%~%" percent-cpu-time (- 100 percent-cpu-time))
      (format t "Hybrid WALL-CLOCK-SEAL-TIME (CPU) is ~,2f% of non-hybrid WALL-CLOCK-SEAL-TIME.~%This is a savings of ~,2f%.~%~%" percent-wall-time (- 100 percent-wall-time)))
#+END_SRC

#+RESULTS:
: Hybrid SEAL-TIME (CPU) is 89.08% of non-hybrid SEAL-TIME.
: This is a savings of 10.92%.
: 
: Hybrid WALL-CLOCK-SEAL-TIME (CPU) is 79.18% of non-hybrid WALL-CLOCK-SEAL-TIME.
: This is a savings of 20.82%.
: 

** FGR
#+BEGIN_SRC lisp :package replication :exports results

(org-present (project '(one-year-fgr two-year-fgr three-year-fgr) *zigzag-alt-base*) nil)

#+END_SRC

#+RESULTS:
| ONE-YEAR-FGR | TWO-YEAR-FGR | THREE-YEAR-FGR |
|    3.5845745 |     8.824088 |      14.063601 |

** Hybrid Merkle Trees
#+BEGIN_SRC lisp :package replication :exports results
(org-present (tref 'optimal-heights (extract (project '(optimal-heights) *zigzag-alt-base*))) nil)
#+END_SRC

#+RESULTS:
| CIRCUIT-TIME | HASHING-TIME | LAYER-INDEX | CONSTRAINTS | LOWEST-TIME | OPTIMAL-BETA-MERKLE-HEIGHT |
|          0.0 |     58.78898 |           0 |           0 |    58.78898 |                         30 |
|     7866.365 |    1087.6437 |           1 |   193290880 |    8954.009 |                          4 |
|     7866.365 |    1087.6437 |           2 |   193290880 |    8954.009 |                          4 |
|     7866.365 |    1087.6437 |           3 |   193290880 |    8954.009 |                          4 |
|    10418.262 |    2116.4985 |           4 |   257536320 |    12534.76 |                          3 |
|    15280.117 |    2116.4985 |           5 |   377719936 |   17396.615 |                          3 |
|    19881.344 |     4174.208 |           6 |   495299904 |    24055.55 |                          2 |
|    25263.771 |     8289.627 |           7 |   636029856 |     33553.4 |                          1 |
|     38023.25 |     8289.627 |           8 |   957257056 |   46312.875 |                          1 |
|     46639.72 |    16520.465 |           9 |  1191833312 |   63160.184 |                          0 |
|      69855.0 |    16520.465 |          10 |  1785077696 |    86375.47 |                          0 |

