replication/replication.html

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Alternate ZigZag Projections</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Sector</h3>
<div class="outline-text-3" id="text-2-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="right" />
</colgroup>
<tbody>
<tr>
<td class="right">SECTOR-GIB</td>
<td class="right">SECTOR-SIZE</td>
</tr>

<tr>
<td class="right">32</td>
<td class="right">34359738368</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Replication</h3>
<div class="outline-text-3" id="text-2-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="right" />
</colgroup>
<tbody>
<tr>
<td class="right">REPLICATION-TIME</td>
<td class="right">REPLICATION-TIME-PER-GIB</td>
</tr>

<tr>
<td class="right">4115.2285</td>
<td class="right">128.60089</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Sealing</h3>
<div class="outline-text-3" id="text-2-3">
</div><ol class="org-ol"><li><a id="sec-2-3-1" name="sec-2-3-1"></a><b>No Hybrid Merkle</b><br  /><div class="outline-text-4" id="text-2-3-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />
</colgroup>
<tbody>
<tr>
<td class="right">SEAL-PARALLELISM</td>
<td class="right">WALL-CLOCK-SEAL-TIME</td>
<td class="right">GIB-SEAL-COST</td>
<td class="right">SEAL-TIME</td>
<td class="right">GIB-HOUR-SEAL-INVESTMENT</td>
<td class="right">GIB-SEAL-TIME</td>
<td class="right">WALL-CLOCK-SEAL-TIME-PER-GIB</td>
</tr>

<tr>
<td class="right">14</td>
<td class="right">27994.111</td>
<td class="right">0.07848823</td>
<td class="right">396032.78</td>
<td class="right">171.88922</td>
<td class="right">12376.024</td>
<td class="right">874.816</td>
</tr>
</tbody>
</table>
</div>
</li>

<li><a id="sec-2-3-2" name="sec-2-3-2"></a><b>Hybrid Merkle</b><br  /><div class="outline-text-4" id="text-2-3-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />
</colgroup>
<tbody>
<tr>
<td class="right">SEAL-PARALLELISM</td>
<td class="right">WALL-CLOCK-SEAL-TIME</td>
<td class="right">GIB-SEAL-COST</td>
<td class="right">SEAL-TIME</td>
<td class="right">GIB-HOUR-SEAL-INVESTMENT</td>
<td class="right">GIB-SEAL-TIME</td>
<td class="right">WALL-CLOCK-SEAL-TIME-PER-GIB</td>
</tr>

<tr>
<td class="right">14</td>
<td class="right">22164.979</td>
<td class="right">0.062314685</td>
<td class="right">314424.9</td>
<td class="right">136.46916</td>
<td class="right">9825.778</td>
<td class="right">692.6556</td>
</tr>
</tbody>
</table>
</div>
</li>

<li><a id="sec-2-3-3" name="sec-2-3-3"></a><b>Hybrid Savings</b><br  /><div class="outline-text-4" id="text-2-3-3">
<pre class="example">
Hybrid SEAL-TIME (CPU) is 89.08% of non-hybrid SEAL-TIME.
This is a savings of 10.92%.

Hybrid WALL-CLOCK-SEAL-TIME (CPU) is 79.18% of non-hybrid WALL-CLOCK-SEAL-TIME.
This is a savings of 20.82%.
</pre>
</div>
</li></ol>
</div>
