replication/replication.org
* Schema
#+BEGIN_SRC lisp :package replication :exports results
  (loop for schema in (all-system-schemas (zigzag-system))
     append (loop for parameter in (schema-parameters schema)
               collect (list (string-downcase (symbol-name (parameter-name parameter))) (parameter-description parameter))))
#+END_SRC

#+RESULTS:
| node-bytes                           | The number of bytes in a node -- must also be the hash digest size.                                                                                                                                                                                                            |
| sector-gib                           | Size of one sector. Unit: GiB                                                                                                                                                                                                                                                  |
| sector-size                          | Size of one sector. Unit: bytes                                                                                                                                                                                                                                                |
| comm-d-size                          | Size of the data commitment (CommD). Unit: bytes                                                                                                                                                                                                                               |
| comm-r-size                          | Size of the replica commitment (CommR). Unit: bytes                                                                                                                                                                                                                            |
| comm-r-star-size                     | Size of the aggregated commitment to each layer's replica (CommR*). Unit: bytes                                                                                                                                                                                                |
| comm-rs-size                         | Size of all replica commitments. Unit: bytes                                                                                                                                                                                                                                   |
| commitments-size                     | Size of all commitments returned by Seal. Unit: bytes                                                                                                                                                                                                                          |
| on-chain-porep-size                  | On-chain size of one Seal proof plus commitments. Unit: bytes                                                                                                                                                                                                                  |
| degree                               | Total in-degree of the ZigZag graph.                                                                                                                                                                                                                                           |
| base-degree                          | In-degree of the base depth-robust graph (DRG).                                                                                                                                                                                                                                |
| expansion-degree                     | Maximum in-degree of the bipartite expander graph component of a ZigZag graph.                                                                                                                                                                                                 |
| sloth-iter                           | Number of iterations of sloth verifiable delay encoding (VDE) to perform.                                                                                                                                                                                                      |
| partitions                           | Number of circuit partitions into which a proof is divided.                                                                                                                                                                                                                    |
| replication-time                     | Time to replicate one sector. Unit: seconds                                                                                                                                                                                                                                    |
| replication-time-per-byte            | Time to replicate one byte. Unit: seconds / byte                                                                                                                                                                                                                               |
| replication-time-per-gib             | Time to replicate one GiB. Unit: seconds / GiB                                                                                                                                                                                                                                 |
| sealing-time                         | Total CPU time to seal (replicate + generate proof of replication) one sector. Unit: seconds                                                                                                                                                                                   |
| non-circuit-proving-time             | Time (including replication) to generate a non-circuit proof of replication. Unit: seconds                                                                                                                                                                                     |
| vector-commitment-time               | Time to generate the vector commitments used in a non-circuit proof of replication. Unit: seconds                                                                                                                                                                              |
| circuit-proving-time-per-constraint  | Groth16 circuit proving time (from benchmarks) per constraint. Unit: seconds                                                                                                                                                                                                   |
| zigzag-total-proving-time            | Total time to generate a proof of replication (circuit and non-circuit). Unit: seconds                                                                                                                                                                                         |
| seal-time                            | Total time to seal (replication + proving) one sector. Unit: seconds                                                                                                                                                                                                           |
| wall-clock-seal-time                 | Wall clock time sealing time using SEAL-PARALLELISM cores. Unit: seconds                                                                                                                                                                                                       |
| seal-parallelism                     | Number of cores utilized when computing wall-clock-seal-time.                                                                                                                                                                                                                  |
| sector-gib                           | Number of GiB in one sector. Unit: GiB                                                                                                                                                                                                                                         |
| gib-seal-time                        | Total time to seal (replication + proving) one GiB. Unit: seconds                                                                                                                                                                                                              |
| total-parents                        | Number of parents (or padding) each node uses when performing key derivation.                                                                                                                                                                                                  |
| hash-functions                       | Alternate hash functions for use in merkle-tree generation, KDF, or other commitments. All values here assume 64 bytes of raw input, but benchmarks include any extra, 'personalization', bits/bytes included as input during merkle-tree construction.                        |
| single-kdf-hashes                    | Number of hashes performed as part of a single application of the key-derivation function (KDF). This is equal to the number of parents and includes the replica ID. Since we use Merkle-Damgard construction, the number of compression hashes is the number of elements - 1. |
| kdf-hashes                           | Number of hashes performed as part of the key-derivation function (KDF).                                                                                                                                                                                                       |
| single-kdf-time                      | Hashing time to perform a single KDF. Unit: seconds                                                                                                                                                                                                                            |
| single-layer-merkle-hashing-time     | Merkle hashing time for a single layer. Unit: seconds                                                                                                                                                                                                                          |
| total-merkle-trees                   | Total merkle trees which must be generated.                                                                                                                                                                                                                                    |
| total-merkle-hashing-time            | Total time to generate all merkle trees. Unit: seconds                                                                                                                                                                                                                         |
| total-nodes-to-encode                | Total nodes to encode across all layers.                                                                                                                                                                                                                                       |
| single-node-sloth-time               | Time to perform sloth (VDE) for a single node. Unit: seconds                                                                                                                                                                                                                   |
| single-node-encoding-time            | Time to encode a single node. Unit: seconds                                                                                                                                                                                                                                    |
| single-challenge-inclusion-proofs    | Number of inclusion proofs which must be verified for a single challenge.                                                                                                                                                                                                      |
| single-challenge-merkle-hases        | Number of merkle hashes which must be verified for a single challenge.                                                                                                                                                                                                         |
| single-challenge-kdf-hashes          | Number of KDF hashes which must be verified for a single challenge.                                                                                                                                                                                                            |
| single-challenge-sloth-verifications | Number of sloth iterations which must be verified for a single challenge.                                                                                                                                                                                                      |
| total-kdf-hashes                     | Total number of KDF (key-derivation function) required during replication.                                                                                                                                                                                                     |
| total-zigzag-kdf-hashing-constraints | Total number of kdf hashing constraints in a ZigZag circuit.                                                                                                                                                                                                                   |
| total-zigzag-non-hashing-constraints | Total number of hashes which must be verified in a ZigZag circuit.                                                                                                                                                                                                             |
| total-zigzag-circuit-kdf-hashes      | Total number of KDF hashes which must be verified in a ZigZag circuit.                                                                                                                                                                                                         |
| total-zigzag-sloth-constraints       | Total number of constraints due to sloth verification.                                                                                                                                                                                                                         |
| total-zigzag-constraints             | Total number of constraints which must be verified in a ZigZag circuit.                                                                                                                                                                                                        |
| layer-index                          | Index of layer. Unit: integer                                                                                                                                                                                                                                                  |
| layer-replication-time               | Time to replicate one layer. Unit: seconds                                                                                                                                                                                                                                     |
| storage-to-proof-size-ratio          | Ratio of sealed sector size to on-chain PoRep size.                                                                                                                                                                                                                            |
| storage-to-proof-size-float          | Ratio of sealed sector size to on-chain PoRep size -- expressed as a float.                                                                                                                                                                                                    |
| single-circuit-proof-size            | Size of a single Groth16 Proof. Unit: bytes                                                                                                                                                                                                                                    |
| total-circuit-proof-size             | Total size of a single circuit proof. Unit: bytes                                                                                                                                                                                                                              |
| total-challenges                     |                                                                                                                                                                                                                                                                                |
| partition-challenges                 |                                                                                                                                                                                                                                                                                |
| kdf-hash-function.size               | Size of digest (output) generated by *.HASH-FUNCTION.                                                                                                                                                                                                                          |
| kdf-hash-function.circuit-time       | Time for one *.HASH-FUNCTION in circuit.                                                                                                                                                                                                                                       |
| kdf-hash-function.constraints        | Number of constraints required to prove *.HASH-FUNCTION in circuit.                                                                                                                                                                                                            |
| kdf-hash-function.hash-function%     | Tuple containing the selected hash function's characteristics.                                                                                                                                                                                                                 |
| merkle-hash-function.size            | Size of digest (output) generated by *.HASH-FUNCTION.                                                                                                                                                                                                                          |
| merkle-hash-function.circuit-time    | Time for one *.HASH-FUNCTION in circuit.                                                                                                                                                                                                                                       |
| merkle-hash-function.constraints     | Number of constraints required to prove *.HASH-FUNCTION in circuit.                                                                                                                                                                                                            |
| merkle-hash-function.hash-function%  | Tuple containing the selected hash function's characteristics.                                                                                                                                                                                                                 |
| alpha-hash-function.size             | Size of digest (output) generated by *.HASH-FUNCTION.                                                                                                                                                                                                                          |
| alpha-hash-function.circuit-time     | Time for one *.HASH-FUNCTION in circuit.                                                                                                                                                                                                                                       |
| alpha-hash-function.constraints      | Number of constraints required to prove *.HASH-FUNCTION in circuit.                                                                                                                                                                                                            |
| alpha-hash-function.hash-function%   | Tuple containing the selected hash function's characteristics.                                                                                                                                                                                                                 |
| beta-hash-function.size              | Size of digest (output) generated by *.HASH-FUNCTION.                                                                                                                                                                                                                          |
| beta-hash-function.circuit-time      | Time for one *.HASH-FUNCTION in circuit.                                                                                                                                                                                                                                       |
| beta-hash-function.constraints       | Number of constraints required to prove *.HASH-FUNCTION in circuit.                                                                                                                                                                                                            |
| beta-hash-function.hash-function%    | Tuple containing the selected hash function's characteristics.                                                                                                                                                                                                                 |
| zigzag-soundness                     | ZigZag soundness: Unit fraction                                                                                                                                                                                                                                                |
| zigzag-lambda                        | ZigZag soundness: Unit bits                                                                                                                                                                                                                                                    |
| zigzag-epsilon                       | Maximum allowable deletion (space tightness): Unit: fraction                                                                                                                                                                                                                   |
| zigzag-delta                         | Maximum allowable cheating on labels (block corruption)                                                                                                                                                                                                                        |
| zigzag-basic-layer-challenges        | Multiple of lambda challenges per layer, without tapering optimization.                                                                                                                                                                                                        |
| zigzag-basic-layer-challenge-factor  | Number of challenges which, when multiplied by lambda, yields the number of challenges per layer without tapering optimization.                                                                                                                                                |
| zigzag-space-gap                     | Maximum allowable gap between actual and claimed storage. Unit: fraction                                                                                                                                                                                                       |
| zigzag-layer-challenges              | Number of challenges in this (indexed) layer of ZigZag PoRep. Unit: integer                                                                                                                                                                                                    |
| layers                               | Number of layers specified for this construction (not necessarily same as calculated from security parameters).                                                                                                                                                                |
# * ZigZag Report/Trace
# #+BEGIN_SRC lisp :package replication :exports results :results output html
#   (with-open-file (orient.web.html:*html-output-stream* "zigzag-report.html" :direction :output :if-exists :supersede :if-does-not-exist :create)
#     (orient.web.html:html-print `(:html ,*zigzag-base-report*)))

# (princ "<a href='zigzag-report.html' download>ZigZag Report</a>")
# #+END_SRC

# #+RESULTS:
# #+BEGIN_HTML
# <a href='zigzag-report.html' download>ZigZag Report</a>
# #+END_HTML
