replication/replication.html

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> FGR</h3>
<div class="outline-text-3" id="text-2-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="right" />

<col  class="right" />
</colgroup>
<tbody>
<tr>
<td class="right">ONE-YEAR-FGR</td>
<td class="right">TWO-YEAR-FGR</td>
<td class="right">THREE-YEAR-FGR</td>
</tr>

<tr>
<td class="right">3.5845745</td>
<td class="right">8.824088</td>
<td class="right">14.063601</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> Hybrid Merkle Trees</h3>
<div class="outline-text-3" id="text-2-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />
</colgroup>
<tbody>
<tr>
<td class="right">CIRCUIT-TIME</td>
<td class="right">HASHING-TIME</td>
<td class="right">LAYER-INDEX</td>
<td class="right">CONSTRAINTS</td>
<td class="right">LOWEST-TIME</td>
<td class="right">OPTIMAL-BETA-MERKLE-HEIGHT</td>
</tr>

<tr>
<td class="right">0.0</td>
<td class="right">58.78898</td>
<td class="right">0</td>
<td class="right">0</td>
<td class="right">58.78898</td>
<td class="right">30</td>
</tr>

<tr>
<td class="right">7866.365</td>
<td class="right">1087.6437</td>
<td class="right">1</td>
<td class="right">193290880</td>
<td class="right">8954.009</td>
<td class="right">4</td>
</tr>

<tr>
<td class="right">7866.365</td>
<td class="right">1087.6437</td>
<td class="right">2</td>
<td class="right">193290880</td>
<td class="right">8954.009</td>
<td class="right">4</td>
</tr>

<tr>
<td class="right">7866.365</td>
<td class="right">1087.6437</td>
<td class="right">3</td>
<td class="right">193290880</td>
<td class="right">8954.009</td>
<td class="right">4</td>
</tr>

<tr>
<td class="right">10418.262</td>
<td class="right">2116.4985</td>
<td class="right">4</td>
<td class="right">257536320</td>
<td class="right">12534.76</td>
<td class="right">3</td>
</tr>

<tr>
<td class="right">15280.117</td>
<td class="right">2116.4985</td>
<td class="right">5</td>
<td class="right">377719936</td>
<td class="right">17396.615</td>
<td class="right">3</td>
</tr>

<tr>
<td class="right">19881.344</td>
<td class="right">4174.208</td>
<td class="right">6</td>
<td class="right">495299904</td>
<td class="right">24055.55</td>
<td class="right">2</td>
</tr>

<tr>
<td class="right">25263.771</td>
<td class="right">8289.627</td>
<td class="right">7</td>
<td class="right">636029856</td>
<td class="right">33553.4</td>
<td class="right">1</td>
</tr>

<tr>
<td class="right">38023.25</td>
<td class="right">8289.627</td>
<td class="right">8</td>
<td class="right">957257056</td>
<td class="right">46312.875</td>
<td class="right">1</td>
</tr>

<tr>
<td class="right">46639.72</td>
<td class="right">16520.465</td>
<td class="right">9</td>
<td class="right">1191833312</td>
<td class="right">63160.184</td>
<td class="right">0</td>
</tr>

<tr>
<td class="right">69855.0</td>
<td class="right">16520.465</td>
<td class="right">10</td>
<td class="right">1785077696</td>
<td class="right">86375.47</td>
<td class="right">0</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Schema</h2>
<div class="outline-text-2" id="text-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">node-bytes</td>
<td class="left">The number of bytes in a node &#x2013; must also be the hash digest size.</td>
</tr>

<tr>
<td class="left">sector-gib</td>
<td class="left">Size of one sector. Unit: GiB</td>
</tr>

<tr>
<td class="left">sector-size</td>
<td class="left">Size of one sector. Unit: bytes</td>
</tr>

<tr>
<td class="left">comm-d-size</td>
<td class="left">Size of the data commitment (CommD). Unit: bytes</td>
</tr>

<tr>
<td class="left">comm-r-size</td>
<td class="left">Size of the replica commitment (CommR). Unit: bytes</td>
</tr>

<tr>
<td class="left">comm-r-star-size</td>
<td class="left">Size of the aggregated commitment to each layer's replica (CommR*). Unit: bytes</td>
</tr>

<tr>
<td class="left">comm-rs-size</td>
<td class="left">Size of all replica commitments. Unit: bytes</td>
</tr>

<tr>
<td class="left">commitments-size</td>
<td class="left">Size of all commitments returned by Seal. Unit: bytes</td>
</tr>

<tr>
<td class="left">on-chain-porep-size</td>
<td class="left">On-chain size of one Seal proof plus commitments. Unit: bytes</td>
</tr>

<tr>
<td class="left">degree</td>
<td class="left">Total in-degree of the ZigZag graph.</td>
</tr>

<tr>
<td class="left">base-degree</td>
<td class="left">In-degree of the base depth-robust graph (DRG).</td>
</tr>

<tr>
<td class="left">expansion-degree</td>
<td class="left">Maximum in-degree of the bipartite expander graph component of a ZigZag graph.</td>
</tr>

<tr>
<td class="left">sloth-iter</td>
<td class="left">Number of iterations of sloth verifiable delay encoding (VDE) to perform.</td>
</tr>

<tr>
<td class="left">partitions</td>
<td class="left">Number of circuit partitions into which a proof is divided.</td>
</tr>

<tr>
<td class="left">replication-time</td>
<td class="left">Time to replicate one sector. Unit: seconds</td>
</tr>

<tr>
<td class="left">replication-time-per-byte</td>
<td class="left">Time to replicate one byte. Unit: seconds / byte</td>
</tr>

<tr>
<td class="left">replication-time-per-gib</td>
<td class="left">Time to replicate one GiB. Unit: seconds / GiB</td>
</tr>

<tr>
<td class="left">sealing-time</td>
<td class="left">Total CPU time to seal (replicate + generate proof of replication) one sector. Unit: seconds</td>
</tr>

<tr>
<td class="left">non-circuit-proving-time</td>
<td class="left">Time (including replication) to generate a non-circuit proof of replication. Unit: seconds</td>
</tr>

<tr>
<td class="left">vector-commitment-time</td>
<td class="left">Time to generate the vector commitments used in a non-circuit proof of replication. Unit: seconds</td>
</tr>

<tr>
<td class="left">circuit-proving-time-per-constraint</td>
<td class="left">Groth16 circuit proving time (from benchmarks) per constraint. Unit: seconds</td>
</tr>

<tr>
<td class="left">zigzag-total-proving-time</td>
<td class="left">Total time to generate a proof of replication (circuit and non-circuit). Unit: seconds</td>
</tr>

<tr>
<td class="left">seal-time</td>
<td class="left">Total time to seal (replication + proving) one sector. Unit: seconds</td>
</tr>

<tr>
<td class="left">wall-clock-seal-time</td>
<td class="left">Wall clock time sealing time using SEAL-PARALLELISM cores. Unit: seconds</td>
</tr>

<tr>
<td class="left">seal-parallelism</td>
<td class="left">Number of cores utilized when computing wall-clock-seal-time.</td>
</tr>

<tr>
<td class="left">sector-gib</td>
<td class="left">Number of GiB in one sector. Unit: GiB</td>
</tr>

<tr>
<td class="left">gib-seal-time</td>
<td class="left">Total time to seal (replication + proving) one GiB. Unit: seconds</td>
</tr>

<tr>
<td class="left">total-parents</td>
<td class="left">Number of parents (or padding) each node uses when performing key derivation.</td>
</tr>

<tr>
<td class="left">hash-functions</td>
<td class="left">Alternate hash functions for use in merkle-tree generation, KDF, or other commitments. All values here assume 64 bytes of raw input, but benchmarks include any extra, 'personalization', bits/bytes included as input during merkle-tree construction.</td>
</tr>

<tr>
<td class="left">single-kdf-hashes</td>
<td class="left">Number of hashes performed as part of a single application of the key-derivation function (KDF). This is equal to the number of parents and includes the replica ID. Since we use Merkle-Damgard construction, the number of compression hashes is the number of elements - 1.</td>
</tr>

<tr>
<td class="left">kdf-hashes</td>
<td class="left">Number of hashes performed as part of the key-derivation function (KDF).</td>
</tr>

<tr>
<td class="left">single-kdf-time</td>
<td class="left">Hashing time to perform a single KDF. Unit: seconds</td>
</tr>

<tr>
<td class="left">single-layer-merkle-hashing-time</td>
<td class="left">Merkle hashing time for a single layer. Unit: seconds</td>
</tr>

<tr>
<td class="left">total-merkle-trees</td>
<td class="left">Total merkle trees which must be generated.</td>
</tr>

<tr>
<td class="left">total-merkle-hashing-time</td>
<td class="left">Total time to generate all merkle trees. Unit: seconds</td>
</tr>

<tr>
<td class="left">total-nodes-to-encode</td>
<td class="left">Total nodes to encode across all layers.</td>
</tr>

<tr>
<td class="left">single-node-sloth-time</td>
<td class="left">Time to perform sloth (VDE) for a single node. Unit: seconds</td>
</tr>

<tr>
<td class="left">single-node-encoding-time</td>
<td class="left">Time to encode a single node. Unit: seconds</td>
</tr>

<tr>
<td class="left">single-challenge-inclusion-proofs</td>
<td class="left">Number of inclusion proofs which must be verified for a single challenge.</td>
</tr>

<tr>
<td class="left">single-challenge-merkle-hases</td>
<td class="left">Number of merkle hashes which must be verified for a single challenge.</td>
</tr>

<tr>
<td class="left">single-challenge-kdf-hashes</td>
<td class="left">Number of KDF hashes which must be verified for a single challenge.</td>
</tr>

<tr>
<td class="left">single-challenge-sloth-verifications</td>
<td class="left">Number of sloth iterations which must be verified for a single challenge.</td>
</tr>

<tr>
<td class="left">total-kdf-hashes</td>
<td class="left">Total number of KDF (key-derivation function) required during replication.</td>
</tr>

<tr>
<td class="left">total-zigzag-kdf-hashing-constraints</td>
<td class="left">Total number of kdf hashing constraints in a ZigZag circuit.</td>
</tr>

<tr>
<td class="left">total-zigzag-non-hashing-constraints</td>
<td class="left">Total number of hashes which must be verified in a ZigZag circuit.</td>
</tr>

<tr>
<td class="left">total-zigzag-circuit-kdf-hashes</td>
<td class="left">Total number of KDF hashes which must be verified in a ZigZag circuit.</td>
</tr>

<tr>
<td class="left">total-zigzag-sloth-constraints</td>
<td class="left">Total number of constraints due to sloth verification.</td>
</tr>

<tr>
<td class="left">total-zigzag-constraints</td>
<td class="left">Total number of constraints which must be verified in a ZigZag circuit.</td>
</tr>

<tr>
<td class="left">layer-index</td>
<td class="left">Index of layer. Unit: integer</td>
</tr>

<tr>
<td class="left">layer-replication-time</td>
<td class="left">Time to replicate one layer. Unit: seconds</td>
</tr>

<tr>
<td class="left">storage-to-proof-size-ratio</td>
<td class="left">Ratio of sealed sector size to on-chain PoRep size.</td>
</tr>

<tr>
<td class="left">storage-to-proof-size-float</td>
<td class="left">Ratio of sealed sector size to on-chain PoRep size &#x2013; expressed as a float.</td>
</tr>

<tr>
<td class="left">single-circuit-proof-size</td>
<td class="left">Size of a single Groth16 Proof. Unit: bytes</td>
</tr>

<tr>
<td class="left">total-circuit-proof-size</td>
<td class="left">Total size of a single circuit proof. Unit: bytes</td>
</tr>

<tr>
<td class="left">total-challenges</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">partition-challenges</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">kdf-hash-function.size</td>
<td class="left">Size of digest (output) generated by *.HASH-FUNCTION.</td>
</tr>

<tr>
<td class="left">kdf-hash-function.circuit-time</td>
<td class="left">Time for one *.HASH-FUNCTION in circuit.</td>
</tr>

<tr>
<td class="left">kdf-hash-function.constraints</td>
<td class="left">Number of constraints required to prove *.HASH-FUNCTION in circuit.</td>
</tr>

<tr>
<td class="left">kdf-hash-function.hash-function%</td>
<td class="left">Tuple containing the selected hash function's characteristics.</td>
</tr>

<tr>
<td class="left">merkle-hash-function.size</td>
<td class="left">Size of digest (output) generated by *.HASH-FUNCTION.</td>
</tr>

<tr>
<td class="left">merkle-hash-function.circuit-time</td>
<td class="left">Time for one *.HASH-FUNCTION in circuit.</td>
</tr>

<tr>
<td class="left">merkle-hash-function.constraints</td>
<td class="left">Number of constraints required to prove *.HASH-FUNCTION in circuit.</td>
</tr>

<tr>
<td class="left">merkle-hash-function.hash-function%</td>
<td class="left">Tuple containing the selected hash function's characteristics.</td>
</tr>

<tr>
<td class="left">alpha-hash-function.size</td>
<td class="left">Size of digest (output) generated by *.HASH-FUNCTION.</td>
</tr>

<tr>
<td class="left">alpha-hash-function.circuit-time</td>
<td class="left">Time for one *.HASH-FUNCTION in circuit.</td>
</tr>

<tr>
<td class="left">alpha-hash-function.constraints</td>
<td class="left">Number of constraints required to prove *.HASH-FUNCTION in circuit.</td>
</tr>

<tr>
<td class="left">alpha-hash-function.hash-function%</td>
<td class="left">Tuple containing the selected hash function's characteristics.</td>
</tr>

<tr>
<td class="left">beta-hash-function.size</td>
<td class="left">Size of digest (output) generated by *.HASH-FUNCTION.</td>
</tr>

<tr>
<td class="left">beta-hash-function.circuit-time</td>
<td class="left">Time for one *.HASH-FUNCTION in circuit.</td>
</tr>

<tr>
<td class="left">beta-hash-function.constraints</td>
<td class="left">Number of constraints required to prove *.HASH-FUNCTION in circuit.</td>
</tr>

<tr>
<td class="left">beta-hash-function.hash-function%</td>
<td class="left">Tuple containing the selected hash function's characteristics.</td>
</tr>

<tr>
<td class="left">zigzag-soundness</td>
<td class="left">ZigZag soundness: Unit fraction</td>
</tr>

<tr>
<td class="left">zigzag-lambda</td>
<td class="left">ZigZag soundness: Unit bits</td>
</tr>

<tr>
<td class="left">zigzag-epsilon</td>
<td class="left">Maximum allowable deletion (space tightness): Unit: fraction</td>
</tr>

<tr>
<td class="left">zigzag-delta</td>
<td class="left">Maximum allowable cheating on labels (block corruption)</td>
</tr>

<tr>
<td class="left">zigzag-basic-layer-challenges</td>
<td class="left">Multiple of lambda challenges per layer, without tapering optimization.</td>
</tr>

<tr>
<td class="left">zigzag-basic-layer-challenge-factor</td>
<td class="left">Number of challenges which, when multiplied by lambda, yields the number of challenges per layer without tapering optimization.</td>
</tr>

<tr>
<td class="left">zigzag-space-gap</td>
<td class="left">Maximum allowable gap between actual and claimed storage. Unit: fraction</td>
</tr>

<tr>
<td class="left">zigzag-layer-challenges</td>
<td class="left">Number of challenges in this (indexed) layer of ZigZag PoRep. Unit: integer</td>
</tr>

<tr>
<td class="left">layers</td>
<td class="left">Number of layers specified for this construction (not necessarily same as calculated from security parameters).</td>
</tr>
</tbody>
</table>
</div>
</div>
