replication/replication.org
* JSON
#+NAME: project-root
#+BEGIN_SRC lisp :package replication :exports none
(namestring (project-root))
#+END_SRC

#+RESULTS: project-root
: /Users/clwk/dev/go/src/github.com/filecoin-project/orient/

#+BEGIN_SRC sh :exports both :results output :var calc="performance" dir=project-root
cd $dir; make ubercalc 2>&1 | /dev/null

./bin/ucalc solve --calc=filecoin | jq

#+END_SRC

#+RESULTS:
#+begin_example
[
  {
    "optimal-heights": {
      "tuples": [
        {
          "constraints": 0,
          "layer-index": 0,
          "lowest-time": 97.94244,
          "circuit-time": 0,
          "hashing-time": 97.94244,
          "optimal-beta-merkle-height": 30
        },
        {
          "constraints": 171690880,
          "layer-index": 1,
          "lowest-time": 24432.822,
          "circuit-time": 20836.523,
          "hashing-time": 3596.2986,
          "optimal-beta-merkle-height": 3
        },
        {
          "constraints": 171690880,
          "layer-index": 2,
          "lowest-time": 24432.822,
          "circuit-time": 20836.523,
          "hashing-time": 3596.2986,
          "optimal-beta-merkle-height": 3
        },
        {
          "constraints": 171690880,
          "layer-index": 3,
          "lowest-time": 24432.822,
          "circuit-time": 20836.523,
          "hashing-time": 3596.2986,
          "optimal-beta-merkle-height": 3
        },
        {
          "constraints": 225136320,
          "layer-index": 4,
          "lowest-time": 34205.582,
          "circuit-time": 27110.928,
          "hashing-time": 7094.655,
          "optimal-beta-merkle-height": 2
        },
        {
          "constraints": 330199936,
          "layer-index": 5,
          "lowest-time": 46857.348,
          "circuit-time": 39762.69,
          "hashing-time": 7094.655,
          "optimal-beta-merkle-height": 2
        },
        {
          "constraints": 424019904,
          "layer-index": 6,
          "lowest-time": 64618.906,
          "circuit-time": 50527.54,
          "hashing-time": 14091.367,
          "optimal-beta-merkle-height": 1
        },
        {
          "constraints": 636029856,
          "layer-index": 7,
          "lowest-time": 89882.68,
          "circuit-time": 75791.31,
          "hashing-time": 14091.367,
          "optimal-beta-merkle-height": 1
        },
        {
          "constraints": 796337056,
          "layer-index": 8,
          "lowest-time": 121573.375,
          "circuit-time": 93488.586,
          "hashing-time": 28084.791,
          "optimal-beta-merkle-height": 0
        },
        {
          "constraints": 1191833312,
          "layer-index": 9,
          "lowest-time": 168003.95,
          "circuit-time": 139919.16,
          "hashing-time": 28084.791,
          "optimal-beta-merkle-height": 0
        },
        {
          "constraints": 1785077696,
          "layer-index": 10,
          "lowest-time": 237649.81,
          "circuit-time": 209565.02,
          "hashing-time": 28084.791,
          "optimal-beta-merkle-height": 0
        }
      ]
    },
    "nodes": 1073741824,
    "degree": 13,
    "layers": 10,
    "profit": true,
    "seal-hz": 5000000000,
    "seal-ghz": 5,
    "daily-tib": 1.1147972,
    "seal-time": 843044.06,
    "fgr-months": 6.409414,
    "hourly-gib": 47.564682,
    "hourly-tib": 0.046449885,
    "needed-ghz": 1740.4132,
    "node-bytes": 32,
    "partitions": 1,
    "sector-gib": 32,
    "sloth-iter": 0,
    "base-degree": 5,
    "comm-d-size": 32,
    "comm-r-size": 32,
    "monthly-tib": 33.908417,
    "sector-size": 34359738368,
    "comm-rs-size": 64,
    "cpu-ghz-cost": 10,
    "gib-capacity": 104166.66,
    "one-year-fgr": 1.1387482,
    "tib-capacity": 101.72525,
    "two-year-fgr": 3.5830317,
    "zigzag-delta": 0.003,
    "zigzag-taper": 0.33333334,
    "annual-income": 50000,
    "gib-seal-cost": 0.16707969,
    "gib-seal-time": 26345.127,
    "total-parents": 13,
    "zigzag-lambda": 8,
    "zigzag-layers": 12,
    "hash-functions": {
      "tuples": [
        {
          "circuit-time": 0.153988,
          "hash-function-name": "pedersen",
          "hash-function-size": 32,
          "hash-function-time": 2.6156e-05,
          "hash-function-constraints": 1324
        },
        {
          "circuit-time": 0.65253,
          "hash-function-name": "blake2s-kdf",
          "hash-function-size": 32,
          "hash-function-time": 4.5608e-08,
          "hash-function-constraints": 5162
        },
        {
          "circuit-time": 1.30506,
          "hash-function-name": "blake2s",
          "hash-function-size": 32,
          "hash-function-time": 9.1216e-08,
          "hash-function-constraints": 10324
        }
      ]
    },
    "monthly-income": 4166.6665,
    "three-year-fgr": 6.027315,
    "tib-drive-cost": 30,
    "zigzag-epsilon": 0.007,
    "gib-seal-cycles": 131725630000000,
    "one-year-profit": 23294.107,
    "single-kdf-time": 6.38512e-07,
    "two-year-profit": 73294.1,
    "alternate-layers": {
      "tuples": [
        {
          "proving-time": 237649.81,
          "beta-merkle-height": 0
        },
        {
          "proving-time": 269791.34,
          "beta-merkle-height": 1
        },
        {
          "proving-time": 308929.63,
          "beta-merkle-height": 2
        },
        {
          "proving-time": 351566.25,
          "beta-merkle-height": 3
        },
        {
          "proving-time": 395952.03,
          "beta-merkle-height": 4
        },
        {
          "proving-time": 441212.38,
          "beta-merkle-height": 5
        },
        {
          "proving-time": 486910.06,
          "beta-merkle-height": 6
        },
        {
          "proving-time": 532826.4,
          "beta-merkle-height": 7
        },
        {
          "proving-time": 578852,
          "beta-merkle-height": 8
        },
        {
          "proving-time": 624932.3,
          "beta-merkle-height": 9
        },
        {
          "proving-time": 671039.94,
          "beta-merkle-height": 10
        },
        {
          "proving-time": 717161.25,
          "beta-merkle-height": 11
        },
        {
          "proving-time": 763289.4,
          "beta-merkle-height": 12
        },
        {
          "proving-time": 809420.9,
          "beta-merkle-height": 13
        },
        {
          "proving-time": 855554.1,
          "beta-merkle-height": 14
        },
        {
          "proving-time": 901688.4,
          "beta-merkle-height": 15
        },
        {
          "proving-time": 947822.8,
          "beta-merkle-height": 16
        },
        {
          "proving-time": 993957.5,
          "beta-merkle-height": 17
        },
        {
          "proving-time": 1040092.5,
          "beta-merkle-height": 18
        },
        {
          "proving-time": 1086227.4,
          "beta-merkle-height": 19
        },
        {
          "proving-time": 1132362.4,
          "beta-merkle-height": 20
        },
        {
          "proving-time": 1178497.4,
          "beta-merkle-height": 21
        },
        {
          "proving-time": 1224632.3,
          "beta-merkle-height": 22
        },
        {
          "proving-time": 1270767.1,
          "beta-merkle-height": 23
        },
        {
          "proving-time": 1316902.3,
          "beta-merkle-height": 24
        },
        {
          "proving-time": 1363037.1,
          "beta-merkle-height": 25
        },
        {
          "proving-time": 1409172.3,
          "beta-merkle-height": 26
        },
        {
          "proving-time": 1455307.1,
          "beta-merkle-height": 27
        },
        {
          "proving-time": 1501442,
          "beta-merkle-height": 28
        },
        {
          "proving-time": 1547577.1,
          "beta-merkle-height": 29
        },
        {
          "proving-time": 1593712.1,
          "beta-merkle-height": 30
        }
      ]
    },
    "comm-r-star-size": 32,
    "commitments-size": 96,
    "expansion-degree": 8,
    "replication-time": 6855.9707,
    "seal-parallelism": 14,
    "total-challenges": 2672,
    "zigzag-soundness": 0.00390625,
    "zigzag-space-gap": 0.01,
    "aws-glacier-price": 0.004,
    "single-kdf-hashes": 14,
    "three-year-profit": 123294.1,
    "must-have-filecoin": true,
    "total-circuit-time": 698674.8,
    "total-hashing-time": 137513.25,
    "total-proving-time": 836188.06,
    "on-chain-porep-size": 288,
    "space-gap-satisfied": true,
    "total-up-front-cost": 20455.89,
    "up-front-drive-cost": 3051.7576,
    "minimum-one-year-fgr": -2,
    "minimum-two-year-fgr": 0.25,
    "partition-challenges": 2672,
    "seal-cycles-per-hour": 6265487600000000,
    "up-front-memory-cost": 0,
    "wall-clock-seal-time": 59727.72,
    "income-during-ramp-up": 6250,
    "total-nodes-to-encode": 10737418240,
    "up-front-compute-cost": 17404.133,
    "up-front-sealing-cost": 17404.133,
    "fgr-months-at-capacity": 3.4094138,
    "kdf-hash-function-name": "blake2s-kdf",
    "kdf-hash-function.size": 32,
    "kdf-hash-function.time": 4.5608e-08,
    "layer-replication-time": 685.59705,
    "max-beta-merkle-height": 30,
    "minimum-three-year-fgr": 1,
    "one-year-fgr-satisfied": true,
    "one-year-profit-months": 5.590586,
    "seal-cycles-per-minute": 104424790000000,
    "seal-cycles-per-second": 1740413200000,
    "single-node-sloth-time": 0,
    "two-year-fgr-satisfied": true,
    "two-year-profit-months": 17.590586,
    "beta-hash-function-name": "blake2s",
    "beta-hash-function.size": 32,
    "beta-hash-function.time": 9.1216e-08,
    "comparable-monthly-cost": 416.66666,
    "kdf-hash-function.name%": "blake2s-kdf",
    "total-zigzag-challenges": 2672,
    "alpha-hash-function-name": "pedersen",
    "alpha-hash-function.size": 32,
    "alpha-hash-function.time": 2.6156e-05,
    "beta-hash-function.name%": "blake2s",
    "filecoin-fgr-requirement": true,
    "gib-hour-seal-investment": 365.90454,
    "layer-performance.layers": 10,
    "miner-months-to-capacity": 3,
    "replication-time-per-gib": 214.24908,
    "three-year-fgr-satisfied": true,
    "three-year-profit-months": 29.590586,
    "total-circuit-proof-size": 192,
    "total-zigzag-constraints": 5903706720,
    "alpha-hash-function.name%": "pedersen",
    "bench-circuit-constraints": 10324,
    "income-to-fgr-at-capacity": 14205.891,
    "merkle-hash-function-name": "pedersen",
    "merkle-hash-function.size": 32,
    "merkle-hash-function.time": 2.6156e-05,
    "replication-time-per-byte": 1.9953501e-07,
    "single-circuit-proof-size": 192,
    "single-node-encoding-time": 6.38512e-07,
    "bench-circuit-proving-time": 0.14464,
    "commodity-storage-discount": 10,
    "filecoin-fgr-requirement-1": true,
    "merkle-hash-function.name%": "pedersen",
    "total-untapered-challenges": 32000,
    "maximum-allowable-space-gap": 0.02,
    "single-challenge-kdf-hashes": 14,
    "single-sloth-iteration-time": 123,
    "storage-to-proof-size-float": 119304650,
    "storage-to-proof-size-ratio": 119304650,
    "layer-performance.node-bytes": 32,
    "wall-clock-seal-time-per-gib": 1866.4912,
    "kdf-hash-function.constraints": 5162,
    "layer-performance.layer-index": 10,
    "layer-performance.sector-size": 34359738368,
    "wall-clock-seal-time-per-byte": 1.7383054e-06,
    "zigzag-basic-layer-challenges": 2666.6667,
    "beta-hash-function.constraints": 10324,
    "kdf-hash-function.circuit-time": 0.65253,
    "layer-performance.circuit-time": 1593614.1,
    "total-zigzag-other-constraints": 0,
    "total-zigzag-sloth-constraints": 857712,
    "alpha-hash-function.constraints": 1324,
    "alpha-merkle-hash-function-name": "pedersen",
    "beta-hash-function.circuit-time": 1.30506,
    "filecoin-requirements-satisfied": true,
    "total-zigzag-circuit-kdf-hashes": 37408,
    "alpha-hash-function.circuit-time": 0.153988,
    "filecoin-storage-ratio-satisfied": true,
    "kdf-hash-function.hash-function%": {
      "circuit-time": 0.65253,
      "hash-function-name": "blake2s-kdf",
      "hash-function-size": 32,
      "hash-function-time": 4.5608e-08,
      "hash-function-constraints": 5162
    },
    "merkle-hash-function.constraints": 1324,
    "beta-hash-function.hash-function%": {
      "circuit-time": 1.30506,
      "hash-function-name": "blake2s",
      "hash-function-size": 32,
      "hash-function-time": 9.1216e-08,
      "hash-function-constraints": 10324
    },
    "kdf-hash-function.hash-functions%": {
      "tuples": [
        {
          "circuit-time": 0.153988,
          "hash-function-name": "pedersen",
          "hash-function-size": 32,
          "hash-function-time": 2.6156e-05,
          "hash-function-constraints": 1324
        },
        {
          "circuit-time": 0.65253,
          "hash-function-name": "blake2s-kdf",
          "hash-function-size": 32,
          "hash-function-time": 4.5608e-08,
          "hash-function-constraints": 5162
        },
        {
          "circuit-time": 1.30506,
          "hash-function-name": "blake2s",
          "hash-function-size": 32,
          "hash-function-time": 9.1216e-08,
          "hash-function-constraints": 10324
        }
      ]
    },
    "merkle-hash-function.circuit-time": 0.153988,
    "single-challenge-inclusion-proofs": 15,
    "alpha-hash-function.hash-function%": {
      "circuit-time": 0.153988,
      "hash-function-name": "pedersen",
      "hash-function-size": 32,
      "hash-function-time": 2.6156e-05,
      "hash-function-constraints": 1324
    },
    "beta-hash-function.hash-functions%": {
      "tuples": [
        {
          "circuit-time": 0.153988,
          "hash-function-name": "pedersen",
          "hash-function-size": 32,
          "hash-function-time": 2.6156e-05,
          "hash-function-constraints": 1324
        },
        {
          "circuit-time": 0.65253,
          "hash-function-name": "blake2s-kdf",
          "hash-function-size": 32,
          "hash-function-time": 4.5608e-08,
          "hash-function-constraints": 5162
        },
        {
          "circuit-time": 1.30506,
          "hash-function-name": "blake2s",
          "hash-function-size": 32,
          "hash-function-time": 9.1216e-08,
          "hash-function-constraints": 10324
        }
      ]
    },
    "layer-performance.layer-challenges": 2672,
    "single-sloth-iteration-constraints": 321,
    "alpha-hash-function.hash-functions%": {
      "tuples": [
        {
          "circuit-time": 0.153988,
          "hash-function-name": "pedersen",
          "hash-function-size": 32,
          "hash-function-time": 2.6156e-05,
          "hash-function-constraints": 1324
        },
        {
          "circuit-time": 0.65253,
          "hash-function-name": "blake2s-kdf",
          "hash-function-size": 32,
          "hash-function-time": 4.5608e-08,
          "hash-function-constraints": 5162
        },
        {
          "circuit-time": 1.30506,
          "hash-function-name": "blake2s",
          "hash-function-size": 32,
          "hash-function-time": 9.1216e-08,
          "hash-function-constraints": 10324
        }
      ]
    },
    "circuit-proving-time-per-constraint": 1.4010074e-05,
    "layer-performance.beta-hashing-time": 97.94244,
    "merkle-hash-function.hash-function%": {
      "circuit-time": 0.153988,
      "hash-function-name": "pedersen",
      "hash-function-size": 32,
      "hash-function-time": 2.6156e-05,
      "hash-function-constraints": 1324
    },
    "minimum-storage-to-proof-size-ratio": 42949670,
    "zigzag-basic-layer-challenge-factor": 333.33334,
    "layer-performance.alpha-hashing-time": 0,
    "layer-performance.merkle-tree.height": 30,
    "layer-performance.merkle-tree.leaves": 1073741824,
    "merkle-hash-function.hash-functions%": {
      "tuples": [
        {
          "circuit-time": 0.153988,
          "hash-function-name": "pedersen",
          "hash-function-size": 32,
          "hash-function-time": 2.6156e-05,
          "hash-function-constraints": 1324
        },
        {
          "circuit-time": 0.65253,
          "hash-function-name": "blake2s-kdf",
          "hash-function-size": 32,
          "hash-function-time": 4.5608e-08,
          "hash-function-constraints": 5162
        },
        {
          "circuit-time": 1.30506,
          "hash-function-name": "blake2s",
          "hash-function-size": 32,
          "hash-function-time": 9.1216e-08,
          "hash-function-constraints": 10324
        }
      ]
    },
    "single-challenge-sloth-verifications": 0,
    "total-zigzag-kdf-hashing-constraints": 193100096,
    "total-zigzag-non-hashing-constraints": 857712,
    "average-monthly-income-during-ramp-up": 2083.3333,
    "filecoin-porep-requirements-satisfied": true,
    "layer-performance.challenge-constraints": 4718068,
    "layer-performance.challenge-circuit-time": 596.4125,
    "layer-performance.layer-challenge-proofs": 15,
    "layer-performance.max-beta-merkle-height": 30,
    "layer-performance.merkle-tree.height-raw": 30,
    "layer-performance.merkle-tree.node-bytes": 32,
    "layer-performance.beta-hash-function.time": 9.1216e-08,
    "layer-performance.merkle-tree.beta-height": 30,
    "layer-performance.merkle-tree.sector-size": 34359738368,
    "layer-performance.alpha-hash-function.time": 2.6156e-05,
    "layer-performance.merkle-tree.alpha-height": 0,
    "layer-performance.merkle-tree.alpha-leaves": 1,
    "layer-performance.challenge-kdf-constraints": 72268,
    "layer-performance.challenge-kdf-circuit-time": 9.13542,
    "layer-performance.inclusion-proof-constraints": 309720,
    "layer-performance.merkle-tree.beta-hash-count": 1073741823,
    "layer-performance.single-challenge-kdf-hashes": 14,
    "filecoin-porep-security-requirements-satisfied": true,
    "layer-performance.inclusion-proof-circuit-time": 39.151802,
    "layer-performance.merkle-tree.alpha-hash-count": 0,
    "layer-performance.merkle-tree.total-hash-count": 1073741823,
    "layer-performance.kdf-hash-function.constraints": 5162,
    "layer-performance.beta-hash-function.constraints": 10324,
    "layer-performance.kdf-hash-function.circuit-time": 0.65253,
    "layer-performance.alpha-hash-function.constraints": 1324,
    "layer-performance.beta-hash-function.circuit-time": 1.30506,
    "layer-performance.challenge-inclusion-constraints": 4645800,
    "layer-performance.alpha-hash-function.circuit-time": 0.153988,
    "layer-performance.beta-inclusion-proof-constraints": 309720,
    "layer-performance.challenge-inclusion-circuit-time": 587.27704,
    "layer-performance.alpha-inclusion-proof-constraints": 0,
    "layer-performance.beta-inclusion-proof-circuit-time": 39.151802,
    "layer-performance.single-challenge-inclusion-proofs": 15,
    "layer-performance.alpha-inclusion-proof-circuit-time": 0,
    "layer-performance.circuit-proving-time-per-constraint": 1.4010074e-05,
    "layer-performance.merkle-tree.beta-inclusion-proof-hash-length": 30,
    "layer-performance.merkle-tree.alpha-inclusion-proof-hash-length": 0,
    "layer-performance.merkle-tree.total-inclusion-proof-hash-length": 30
  }
]
#+end_example
